In [1]:
import numpy as np
import pandas as pd

In [5]:
labels =['a','b', 'c','d','e']
mylist = np.array([1,2,3,4,5])

In [6]:
pd.Series(mylist)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
pd.Series(mylist,labels)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [8]:
pd.Series(labels)

0    a
1    b
2    c
3    d
4    e
dtype: object

In [11]:
ser1 = pd.Series([1,2,3],['a','b','c'])

In [12]:
ser2 = pd.Series([2,3,4], ['a','b','c'])

In [14]:
ser1['b']

2

In [15]:
# how to add series where the index is a match for both series
ser1 + ser2

a    3
b    5
c    7
dtype: int64

In [19]:
pd.DataFrame([ser1,ser2])

   a  b  c
0  1  2  3
1  2  3  4

In [28]:
data= np.array([
                [1,2,3],
                [2,3,4],
                [2,4,3],
                [5,6,7]])

df =pd.DataFrame(data,index=[4,5,6,7],columns=['a','b','c'])

In [29]:
df

   a  b  c
4  1  2  3
5  2  3  4
6  2  4  3
7  5  6  7

In [30]:
df['a']

4    1
5    2
6    2
7    5
Name: a, dtype: int64

In [31]:
df[['a','b']]

   a  b
4  1  2
5  2  3
6  2  4
7  5  6

In [32]:
df.aggregate

<bound method DataFrame.aggregate of    a  b  c
4  1  2  3
5  2  3  4
6  2  4  3
7  5  6  7>

In [33]:
df.add

<bound method _arith_method_FRAME.<locals>.f of    a  b  c
4  1  2  3
5  2  3  4
6  2  4  3
7  5  6  7>

In [40]:
df['new']=df['a']/df['b']

In [41]:
df

   a  b  c       new
4  1  2  3  0.500000
5  2  3  4  0.666667
6  2  4  3  0.500000
7  5  6  7  0.833333

In [43]:
df.drop('new', axis=1)

   a  b  c
4  1  2  3
5  2  3  4
6  2  4  3
7  5  6  7

In [46]:
df= df.drop(4)

In [47]:
df

   a  b  c       new
5  2  3  4  0.666667
6  2  4  3  0.500000
7  5  6  7  0.833333

In [48]:
df.shape

(3, 4)

In [61]:
df

3

In [78]:
linearpredictor= np.array([
    [1,2,3],
    [2,3,4],
    [4,3,2],
    [3,3,3],
    [3,3,3]
])


df= pd.DataFrame(data=linearpredictor, columns=['a','b','c'])

In [79]:
df['a'] ==3

0    False
1    False
2    False
3     True
4     True
Name: a, dtype: bool

In [80]:
df == 3

       a      b      c
0  False  False   True
1  False   True  False
2  False   True  False
3   True   True   True
4   True   True   True

In [81]:
df[df['a']<3]

   a  b  c
0  1  2  3
1  2  3  4

In [83]:
df[df['a']<3]['a']

0    1
1    2
Name: a, dtype: int64

In [89]:
df[ (df['a']== 3) & (df['c']==3) ]

   a  b  c
3  3  3  3
4  3  3  3

In [90]:
df[ (df['a']== 3) | (df['c']<3) ]

   a  b  c
2  4  3  2
3  3  3  3
4  3  3  3

In [91]:
df

   a  b  c
0  1  2  3
1  2  3  4
2  4  3  2
3  3  3  3
4  3  3  3

In [92]:
df.set_index('c')

   a  b
c
3  1  2
4  2  3
2  4  3
3  3  3
3  3  3

In [98]:
data2 = np.array([
    [1,2,3],
    [4,3,5],
    [3, np.nan,3],
    [3,3,3]
])


df2 =pd.DataFrame(data2, columns=['a','b','c'])

df2

     a    b    c
0  1.0  2.0  3.0
1  4.0  3.0  5.0
2  3.0  NaN  3.0
3  3.0  3.0  3.0

In [100]:
df2.dropna()

     a    b    c
0  1.0  2.0  3.0
1  4.0  3.0  5.0
3  3.0  3.0  3.0

In [ ]:
df3 ={
    'a': [1,2,3,4,5,6,7,8],
    'b': [2,3,4,5,6,7,8,3],
    'c': [5,2,3,4,2,1,2,3]
}

index = np.array([ 'c', 'c','c','b','b','b','a','a',])